#자료형
#숫자
print(273)
print(type(52))
#int는 integer의 앞 세글자를 때어 낸것으로 정수를 의미한다
print(type(52.273))
#float는 floating point의 앞 단어에서 가져온 것으로 실수를 의미한다
#숫자 연산자
#사칙 연산자: +,-,*,/
'''
가장 기본적으로 덧셈,뻴셈,곱셈,나눗셈과 같은 사칙 연산자를 생각할 수 있습니다.
파이썬에서도 숫자에 이와 같은 사칙 연산자를 적용할 수 있습니다
'''
#덧셈
print("5+7=",5+7)
#뻴셈
print("5-7=",5-7)
#곱셈
print("5*7=",5*7)
#나눗셈
print("5/7=",5/7)
#정수 나누기 연산자
print("5/7=",5/7)
print("3/2=",3/2)
print("3//2",3//2)
#나머지
print("5%2=",5%2)
#제곱 연산자
print("2**1=",2**1)
print("2**2=",2**2)
print("2**3=",2**3)
print("2**4=",2**4)
